In [2]:
import bq_helper
import pandas as pd
from sqlalchemy import create_engine

import os

import psycopg2
from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT

In [3]:
directory = "../data/"
listf = os.listdir(directory)
print (listf)

['cities.csv', 'lines.csv', 'stations.csv', 'station_lines.csv', 'systems.csv', 'tracks.csv', 'track_lines.csv', 'ZIP FOLDERS']

In [31]:
filename = directory+listf[0]
cities_df = pd.read_csv(filename)

In [33]:
filename = directory+listf[1]
lines_df = pd.read_csv(filename)

In [34]:
filename = directory+listf[2]
stations_df = pd.read_csv(filename)

In [35]:
filename = directory+listf[3]
station_lines_df = pd.read_csv(filename)

In [37]:
filename = directory+listf[4]
systems_df = pd.read_csv(filename)

In [38]:
filename = directory+listf[5]
tracks_df = pd.read_csv(filename)

In [39]:
filename = directory+listf[6]
tracks_lines_df = pd.read_csv(filename)

In [ ]:
#List of cities in Staion_Lines_df
list_cities = list(station_lines_df["city_id"].unique())

In [50]:
#Cleaning up Cities Dataframa
cities_df1 = cities_df.loc[cities_df["id"].isin(list_cities)]
cities_df2 = cities_df1.rename(columns={"id": "city_id"})
cities_df3 = cities_df2.set_index("city_id")
cities_df4 = cities_df3.drop(columns = ["country_state"])

In [63]:
#Cleaning up Lines Dataframe
lines_df1 = lines_df[lines_df["city_id"].isin(list_cities)]
lines_df2 = lines_df1.rename(columns={"id": "line_id"})
lines_df3 = lines_df2.set_index("line_id")
lines_df4 = lines_df3.drop(columns = ["transport_mode_id"])

In [72]:
#Cleaning stations_df
stations_df1 = stations_df[stations_df["city_id"].isin(list_cities)]
stations_df2 = stations_df1.rename(columns={"id": "station_id"})
stations_df3 = stations_df2.set_index("station_id")

In [75]:
#Cleaning station_lines_df
station_lines_df1 = station_lines_df[station_lines_df["city_id"].isin(list_cities)]
station_lines_df2 = station_lines_df1.rename(columns={"id": "station_line_id"})
station_lines_df3 = station_lines_df2.set_index("station_line_id")

In [82]:
#Cleaning systems_df
systems_df.count()
systems_df1 = systems_df[systems_df["city_id"].isin(list_cities)]
systems_df2 = systems_df1.rename(columns={"id": "system_id"})
systems_df3 = systems_df2.set_index("system_id")

In [135]:
#Cleaning tracks_df
tracks_df1 = tracks_df[tracks_df["city_id"].isin(list_cities)]
tracks_df2 = tracks_df1.rename(columns={"id": "track_id"})
tracks_df3 = tracks_df2.set_index("track_id")

In [106]:
# Cleaning up tracks_lines_df
tracks_lines_df.head()
tracks_lines_df1 = tracks_lines_df[tracks_lines_df["city_id"].isin(list_cities)]
tracks_lines_df2 = tracks_lines_df1.rename(columns={"id": "track_id"})
tracks_lines_df3 = tracks_lines_df2.set_index("track_id")

In [119]:
#Station_lines merged with stations and cleaned up
station_lines_merge = pd.merge(station_lines_df3, stations_df3, left_on="station_id", right_on="station_id")
station_lines_merge1 = station_lines_merge.rename(columns={"city_id_x": "city_id"})
station_lines_merge2 = station_lines_merge1.drop(columns= ["city_id_y"])
station_lines_merge3 = station_lines_merge2.set_index("station_id")
station_lines_merge3.head()

,line_id,city_id,created_at,updated_at,name,geometry,buildstart,opening,closure
station_id,,,,,,,,,
7754,570,74,2017-11-21 00:00:00,2017-11-21 00:00:00,La Fourragère,POINT(5.4241011 43.3038114),NaN,2010.0,999999.0
7771,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00,National,POINT(5.3730689 43.3151538),NaN,1987.0,999999.0
7764,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00,Notre-Dame-du-Mont - Cours Julien,POINT(5.383698 43.2924994),NaN,1984.0,999999.0
7763,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00,Castellane,POINT(5.3845462 43.2849648),NaN,1984.0,999999.0
7729,571,74,2017-11-21 00:00:00,2017-11-21 00:00:00,Jules Guesde,POINT(5.3740003 43.3019393),NaN,1984.0,999999.0

In [108]:
#Track lines merged with tracks
track_lines_merged = pd.merge(tracks_lines_df3, tracks_df3, left_on ="track_id", right_on = "track_id")
track_lines_merged1 = track_lines_merged.rename(columns = {"city_id_x":"city_id"})
track_lines_merged2 = track_lines_merged1.drop(columns = ["city_id_y"])

In [54]:
#Random Example
chicago = station_lines_df.loc[station_lines_df["city_id"] == 147]
print(len(cities_df["country"].unique()))

citig = cities_df.groupby(["country","name"]).count()

73

In [37]:
#TO CREATE A DATABASE IN POSTGRES
conn = psycopg2.connect(user='postgres', host='',password='postgres')
conn.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)
cur = conn.cursor()
cur.execute("CREATE DATABASE transit_test")

In [109]:
#Establish connection to postgres database - transit_test
conn_str = 'postgresql://postgres:postgres@localhost:5432/transit_test'
engine = create_engine(conn_str)

In [110]:
#Pusch cities_df4 data frame as "cities" table in database
cities_df4.to_sql("cities", engine)

In [111]:
#Pusch lines_df4 data frame as "lines" table in database
lines_df4.to_sql("lines", engine)

In [112]:
#Pusch stations_df3 data frame as "stations" table in database
stations_df3.to_sql("stations", engine)

In [113]:
#Pusch station_lines_df3 data frame as "station_lines" table in database
station_lines_df3.to_sql("station_lines", engine)

In [114]:
#Pusch systems_df3 data frame as "systems" table in database
systems_df3.to_sql("systems", engine)

In [115]:
#Pusch tracks_df3 data frame as "tracks" table in database
tracks_df3.to_sql("tracks", engine)

In [116]:
#Pusch tracks_lines_df3 data frame as "track_lines" table in database
tracks_lines_df3.to_sql("track_lines", engine)

In [117]:
#Pusch station_lines_merge3 data frame as "station_lines_merge" table in database
station_lines_merge3.to_sql("station_lines_merge", engine)

In [118]:
#Pusch track_lines_merged2 data frame as "track_lines_merged" table in database
track_lines_merged2.to_sql("track_lines_merged", engine)

In [136]:
stations_df3.head()

,name,geometry,buildstart,opening,closure,city_id
station_id,,,,,,
7694,Keisei Tsudanuma,POINT(140.024812197129 35.6837744784723),1921.0,1921.0,999999.0,114
6003,Kossuth Lajos tér,POINT(19.0462376564033 47.5054880717671),99999.0,0.0,999999.0,29
7732,Saint-Charles,POINT(5.3801556 43.3024646),1973.0,1977.0,999999.0,74
7695,Keisei Makuhari-Hongo,POINT(140.042146725175 35.6726021159981),1991.0,1991.0,999999.0,114
7726,Chartreux,POINT(5.4014815 43.309129),1973.0,1977.0,999999.0,74

In [138]:
lesszero = stations_df3.loc[stations_df3["opening"]<=0]
lesszero.count()

name          1597
geometry      1628
buildstart    1628
opening       1628
closure       1628
city_id       1628
dtype: int64

In [139]:
import numpy as np
stations_df3['buildstart'] = np.where((stations_df3['buildstart'] < 1750) & (stations_df3['buildstart'] > 2100), 99999, stations_df3['buildstart'])

In [141]:
cities_df6 = cities_df

In [142]:
cities_df6.head()

,id,name,coords,start_year,url_name,country,country_state
0,5,Aberdeen,POINT(-2.15 57.15),2017.0,aberdeen,Scotland,NaN
1,6,Adelaide,POINT(138.6 -34.91666667),2017.0,adelaide,Australia,NaN
2,7,Algiers,POINT(3 36.83333333),2017.0,algiers,Algeria,NaN
3,9,Ankara,POINT(32.91666667 39.91666667),2017.0,ankara,Turkey,NaN
4,16,Belém,POINT(-48.48333333 -1.466666667),2017.0,belem,Brazil,NaN

In [146]:
new_city_df = cities_df6["coords"].str.split()
new_city_df.head()

0                  [POINT(-2.15, 57.15)]
1           [POINT(138.6, -34.91666667)]
2                [POINT(3, 36.83333333)]
3      [POINT(32.91666667, 39.91666667)]
4    [POINT(-48.48333333, -1.466666667)]
Name: coords, dtype: object

In [144]:
new_city_df = cities_df6["coords"].str.split("(", n = 1, expand = True)
new_city_df.head()

       0                           1
0  POINT                -2.15 57.15)
1  POINT         138.6 -34.91666667)
2  POINT              3 36.83333333)
3  POINT    32.91666667 39.91666667)
4  POINT  -48.48333333 -1.466666667)

In [145]:
new1_city_df = new_city_df[1].str.split(" ", n = 1, expand = True)
new1_city_df.head()

              0              1
0         -2.15         57.15)
1         138.6  -34.91666667)
2             3   36.83333333)
3   32.91666667   39.91666667)
4  -48.48333333  -1.466666667)

In [ ]:
#Remove the part "POINT(" from coords

new_city_df = city_data_df["coords"].str.split("(", n = 1, expand = True)

#Remove the first "space" from the new column "1"

new1_city_df = new_city_df[1].str.split(" ", n = 1, expand = True)

#Rename the columns "0" and "1" to "Long" and "Lat", respectively

new1_city_df.rename(columns={0:"Long",1:"Lat"}, inplace=True)

#Add "Long" column from new1_city_df to city_data_df

city_data_df["Long"] = new1_city_df["Long"]

# Remove the ")" from Lat in new1_city_df

new2_city_df = new1_city_df["Lat"].str.split(")", n = 1, expand = True)

#Rename the column "0" in new2_city_df to "Lat"

new2_city_df.rename(columns={0:"Lat"}, inplace=True)

#Add the "Lat" column from new2_city_df to city_data_df

city_data_df["Lat"] = new2_city_df["Lat"]